Autodesk.Revit.DB.FillPatternHostOrientation
The types of orientations for fill patterns.
Since:
2012

Autodesk.Revit.DB.FillPatternHostOrientation.ToHost
Patterns align with the host and compute a origin to fit the host.

Autodesk.Revit.DB.FillPatternHostOrientation.AsText
Mimics the behavior of text. Patterns align with the host and share the same origin with respect to view.

Autodesk.Revit.DB.FillPatternHostOrientation.ToView
All patterns share the same orientation and origin with respect to view, so they perfectly align at element transitions.